/*
    * DDL(DATA DEFINITION LANGUAGE) : 데이터 정의 언어
      오라클에서 제공하는 객체(OBJECT)를 만들고(CREATE), 구조를 변경하고(ALTER)하고, 구조를 삭제(DROP) 하는 언어
      즉, 실제 데이터 값이 아닌 구조 자체를 정의하는 언어
      주로 DB관리자, 설계자가 사용함
      
      오라클 객체(구조) : 테이블, 뷰, 시퀀스, 인덱스, 패키지, 트리거, 프로시저, 함수, 동의어, 사용자
*/

--==============================================================
--                                                   CREATE : 객체 생성
--==============================================================
/*
    1. 테이블 생성
      - 테이블이란 : 행과 열로 구성된 가장 기본적인 데이터베이스 객체
                         모든 데이터들은 테이블을 통해 저장됨
    
    [표현식]
    CREATE TABLE 테이블명 (
            컬럼명 자료형(크기),
            컬럼명 자료형(크기),
            컬럼명 자료형,
            ...
    );
    
    
*/









